artillery-test.yaml
config:
  target: "http://localhost:3000/"
  phases:
    - duration: 60
      arrivalRate: 1
    - duration: 60
      arrivalRate: 10
    - duration: 60
      arrivalRate: 100
    - duration: 60
      arrivalRate: 1000
  processor: "./randomnumber.js"

scenarios:
  - name: "Fetch restaurants"
    flow:
      - function: "generateRandomNumber"
      - get:
          url: "http://localhost:3000/{{ id }}"
      - log: "Sent request to /{{ id }}"